Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "do_not_use_in_code" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-tSPzofKX1xmPykDh/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts must be replaced
-/+ resource "kubernetes_job" "run_sql_scripts" {
      ~ id                  = "postgresql/run-sql-scripts" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {} -> (known after apply)
            name             = "run-sql-scripts"
          ~ resource_version = "17759275" -> (known after apply)
          ~ uid              = "bd569494-f58d-46b2-afda-924b451a1811" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - active_deadline_seconds    = 0 -> null
          ~ backoff_limit              = 6 -> 1
          ~ completion_mode            = "NonIndexed" -> (known after apply)
          - manual_selector            = false -> null
            # (3 unchanged attributes hidden)

          - selector {
              - match_labels = {
                  - "batch.kubernetes.io/controller-uid" = "bd569494-f58d-46b2-afda-924b451a1811"
                } -> null
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  - labels           = {} -> null
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      ~ command                    = [
                            # (1 unchanged element hidden)
                            "-h",
                          - "localhost",
                          + "postgresql.postgresql",
                            "-d",
                            # (3 unchanged elements hidden)
                        ]
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "postgres-client"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (3 unchanged blocks hidden)
                    }

                  ~ volume {
                        name = "sql-scripts-volume"

                      ~ config_map {
                            name         = "sql-scripts"
                          - optional     = false -> null
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production -- -target=module.kubernetes.module.postgresql`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`